backend/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
    def index
        render json: Comment.all

INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "this is a comment to the new dom post"], ["post_id", 3], ["created_at", "2021-02-07 04:50:57.080584"], ["updated_at", "2021-02-07 04:50:57.080584"]]
---
    def create
        comment = Comment.new(comment_params)

        if comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_comment
        comment = Comment.find(params[:id])