backend/app/controllers/posts_controller.rb

    def index
        render json: Post.all.map {|post| PostSerializer.new(post)}
---
SELECT "posts".* FROM "posts"

    def create
        post = Post.new(post_params)

        if post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "This is a new post"], ["created_at", "2021-02-07 04:50:47.049550"], ["updated_at", "2021-02-07 04:50:47.049550"]]